livekit/client-sdk-esp32/components/livekit/examples/single_codec/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Credentials ---
# See README.md for setup instructions.
# CONFIG_LK_EXAMPLE_USE_SANDBOX=y
# CONFIG_LK_EXAMPLE_SANDBOX_ID="my-project-xxxxxx"
CONFIG_LK_EXAMPLE_USE_PREGENERATED=y
CONFIG_LK_EXAMPLE_SERVER_URL="ws://localhost:7880"
# CONFIG_LK_EXAMPLE_TOKEN="your-jwt-token"

#
# LiveKit SDK settings — required regardless of board
#
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_PARTITION_TABLE_CUSTOM=y

#
# Board-specific — GMIC HA-TOYMD
# 4 MB flash, 2 MB quad PSRAM. Adapt these to match your board.
#
CONFIG_LK_EXAMPLE_SPEAKER_VOLUME=85
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

#
# Headroom. The WebRTC stack leaves little margin on a 4 MB / quad-PSRAM part:
# Opus encode and decode running together starve the idle task, so the task
# watchdog timeout is raised rather than left at the default.
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
